In [51]:
import pandas as pd

In [52]:
list1 = [1,2,3,4,5]
index=["a","b","c","d","e"]

df=pd.DataFrame(list1,index=index)
df

   0
a  1
b  2
c  3
d  4
e  5

In [53]:
datastudent={"Name":["Rohan","Rahul","Raj","Ravi","Rohit"],
            "Age":[20,21,22,23,24],
            "Marks":[50,60,70,80,90]}
df=pd.DataFrame(datastudent)
df

    Name  Age  Marks
0  Rohan   20     50
1  Rahul   21     60
2    Raj   22     70
3   Ravi   23     80
4  Rohit   24     90

In [54]:
import numpy as np
student=np.array(df)
student

array([['Rohan', 20, 50],
       ['Rahul', 21, 60],
       ['Raj', 22, 70],
       ['Ravi', 23, 80],
       ['Rohit', 24, 90]], dtype=object)

In [55]:
#list of dictioneries
data=[{"Name":"Awais","Age":"20","GPA":"4"},
{"Name":"Areeba","Age":"20","GPA":"Fail"},
{"Name":"kinza","Age":"20","GPA":"4"}]
df=pd.DataFrame(data)
df

     Name Age   GPA
0   Awais  20     4
1  Areeba  20  Fail
2   kinza  20     4

In [56]:
df=pd.read_csv('data.csv')
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [57]:
# df.describe()
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [58]:
df.isnull().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [59]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [60]:
df2=df.fillna(0)
df2.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [61]:
df=df.rename(columns={'Date':'SlaesDate'})
df.head()

    SlaesDate Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [62]:
df['New_Value']=df['Value'].fillna(df['Value'].mean()).astype(int)
df.head()

    SlaesDate Category  Value   Product  Sales Region  New_Value
0  2023-01-01        A   28.0  Product1  754.0   East         28
1  2023-01-02        B   39.0  Product3  110.0  North         39
2  2023-01-03        C   32.0  Product2  398.0   East         32
3  2023-01-04        B    8.0  Product1  522.0   East          8
4  2023-01-05        B   26.0  Product3  869.0  North         26

In [63]:
df=df.drop('New_Value',axis=1)
df.head()

    SlaesDate Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [64]:
#Data agregating and grouping 
grouped_mean=df.groupby('Product')['Value'].mean()
grouped_mean

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [65]:
group_sum=df.groupby(['Product','Region'])['Sales'].sum()
group_sum

Product   Region
Product1  East      4205.0
          North     1737.0
          South     1346.0
          West      1335.0
Product2  East       856.0
          North      843.0
          South     2240.0
          West      3435.0
Product3  East      1956.0
          North     3428.0
          South     1572.0
          West      2675.0
Name: Sales, dtype: float64

In [66]:
group_agg=df.groupby("Region")['Value'].agg(['sum','mean'])
group_agg

           sum       mean
Region
East     550.0  42.307692
North    339.0  37.666667
South    496.0  62.000000
West    1047.0  61.588235

In [72]:
# merging the data frame 
df1 = pd.DataFrame({'Key': ['A', 'B', 'C'], 'Value1': [1, 2, 3]})
df2 = pd.DataFrame({'Key': ['A', 'B', 'D'], 'Value2': [4, 5, 6]})
pd.merge(df1, df2, how='inner', on='Key')

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [74]:
pd.merge(df1, df2, how='outer', on='Key').fillna(0)

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     0.0
3   D     0.0     6.0

In [75]:
pd.merge(df1, df2, how='left', on='Key')

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [76]:
pd.merge(df1, df2, how='right', on='Key')

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6